In [1]:
import pandas as pd

In [29]:
data = {
    "Name":["drani", "martin", "gerald", "oliver"],
    "Math":[67, 66, 55, 79],
    "Economics":[84, 75, 60, 84],
    "Pysics":[60, 73, 46, 82],
    "ICT":[95, 84, 90, 70],
    "GP":[50, 90, 60, 83],
    
       }

In [30]:
# convert into dataframe
df = pd.DataFrame(data)

In [32]:
df.head()

     Name  Math  Economics  Pysics  ICT  GP
0   drani    67         84      60   95  50
1  martin    66         75      73   84  90
2  gerald    55         60      46   90  60
3  oliver    79         84      82   70  83

In [33]:
df.tail()

     Name  Math  Economics  Pysics  ICT  GP
0   drani    67         84      60   95  50
1  martin    66         75      73   84  90
2  gerald    55         60      46   90  60
3  oliver    79         84      82   70  83

In [34]:
df.describe()

            Math  Economics     Pysics        ICT         GP
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean   66.750000  75.750000  65.250000  84.750000  70.750000
std     9.810708  11.324752  15.692355  10.812801  18.856917
min    55.000000  60.000000  46.000000  70.000000  50.000000
25%    63.250000  71.250000  56.500000  80.500000  57.500000
50%    66.500000  79.500000  66.500000  87.000000  71.500000
75%    70.000000  84.000000  75.250000  91.250000  84.750000
max    79.000000  84.000000  82.000000  95.000000  90.000000

In [36]:
df

     Name  Math  Economics  Pysics  ICT  GP
0   drani    67         84      60   95  50
1  martin    66         75      73   84  90
2  gerald    55         60      46   90  60
3  oliver    79         84      82   70  83

In [39]:
c = df[["Math", "Economics", "Pysics", "ICT", "GP"]]

In [54]:
df["Ave_marks"] = 0

In [55]:
df

     Name  Math  Economics  Pysics  ICT  GP  Ave_marks
0   drani    67         84      60   95  50          0
1  martin    66         75      73   84  90          0
2  gerald    55         60      46   90  60          0
3  oliver    79         84      82   70  83          0

In [88]:
df.iloc[0:2,1:4]

   Math  Economics  Pysics
0    67         84      60
1    66         75      73

In [100]:
df.iloc[:, 1:].mean()

Math         66.75
Economics    75.75
Pysics       65.25
ICT          84.75
GP           70.75
Ave_marks     0.00
dtype: float64

In [109]:
df["Name"].str.title()

0     Drani
1    Martin
2    Gerald
3    Oliver
Name: Name, dtype: object

In [118]:
df.iloc[:,0].str.title()

0     Drani
1    Martin
2    Gerald
3    Oliver
Name: Name, dtype: object

In [122]:
data1 = pd.DataFrame({"name": "drani","age":16}, index=[1])
data2 = pd.DataFrame({"name": "bensar","age":20}, index=[1])

In [123]:
data1

    name  age
1  drani   16

In [124]:
data2

     name  age
1  bensar   20

In [126]:
full_data = pd.concat([data1, data2])

In [127]:
full_data

     name  age
1   drani   16
1  bensar   20